## Plan Result (privatelink-privatelink)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * module.blob-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;ss-test-vnet&#34;]
  * module.postgres.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
* Delete
  * module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
* Replace
  * module.azurewebsites-private-link.azurerm_private_dns_zone.zone[0]
  * module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.azurewebsites-private-link.azurerm_private_dns_zone.zone[0] must be replaced
-/+ resource "azurerm_private_dns_zone" "zone" {
      ~ id                                                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net" -> (known after apply)
      ~ max_number_of_record_sets                             = 25000 -> (known after apply)
      ~ max_number_of_virtual_network_links                   = 1000 -> (known after apply)
      ~ max_number_of_virtual_network_links_with_registration = 100 -> (known after apply)
      ~ name                                                  = "privatelink.blob.core.windows.net" -> "privatelink.azurewebsites.net" # forces replacement
      ~ number_of_record_sets                                 = 82 -> (known after apply)
        tags                                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-private-dns"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (1 unchanged attribute hidden)

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.blob.core.windows.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be destroyed
  # (because key ["bastion-prod-vnet"] is not in for_each map)
  - resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      - id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/bastion-prod-vnet" -> null
      - name                  = "bastion-prod-vnet" -> null
      - private_dns_zone_name = "privatelink.blob.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "core-infra-intsvc-rg" -> null
      - tags                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-private-dns"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "ithc"
        } -> null
      - virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet" -> null
    }

  # module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be destroyed
  # (because key ["core-infra-vnet-idam-ithc-internal"] is not in for_each map)
  - resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      - id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/core-infra-vnet-idam-ithc-internal" -> null
      - name                  = "core-infra-vnet-idam-ithc-internal" -> null
      - private_dns_zone_name = "privatelink.blob.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "core-infra-intsvc-rg" -> null
      - tags                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-private-dns"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "ithc"
        } -> null
      - virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc" -> null
    }

  # module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be destroyed
  # (because key ["core-infra-vnet-ithc-internal"] is not in for_each map)
  - resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      - id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/core-infra-vnet-ithc-internal" -> null
      - name                  = "core-infra-vnet-ithc-internal" -> null
      - private_dns_zone_name = "privatelink.blob.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "core-infra-intsvc-rg" -> null
      - tags                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-private-dns"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "ithc"
        } -> null
      - virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc" -> null
    }

  # module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be destroyed
  # (because key ["core-infra-vnet-mgmt"] is not in for_each map)
  - resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      - id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/core-infra-vnet-mgmt" -> null
      - name                  = "core-infra-vnet-mgmt" -> null
      - private_dns_zone_name = "privatelink.blob.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "core-infra-intsvc-rg" -> null
      - tags                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-private-dns"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "ithc"
        } -> null
      - virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt" -> null
    }

  # module.azurewebsites-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      ~ id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/vpn" -> (known after apply)
        name                  = "vpn"
      ~ private_dns_zone_name = "privatelink.blob.core.windows.net" -> "privatelink.azurewebsites.net" # forces replacement
        tags                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-private-dns"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (3 unchanged attributes hidden)
    }

  # module.blob-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["ss-test-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "ss-test-vnet"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet"
    }

  # module.postgres.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "private.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

Plan: 4 to add, 0 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":603,"Program":"tfcmt","SHA1":"","Target":"privatelink-privatelink","Vars":{}} -->